app/Http/Middleware/StartingPoint.php

    public function handle(Request $request, Closure $next)
    {

        $client_host = request()->getHttpHost();
        $filter_host = preg_replace('/^www\./', '', $client_host);

        $referer = $request->headers->get('referer');
        $userAgent = $request->header('User-Agent');
        $ip = $request->ip();

        DB::table('unknown_requests')->insert(
            ['referer' => $referer, 'user_agent' => $userAgent, 'ip_address' => $ip]
        );


        try{
            if(Schema::hasTable("script") && DB::table('script')->exists()) {
---
select exists(select * from `script`) as `exists`
select * from `script` limit 1