app/Http/Helpers/helpers.php

function virtual_card_system($name)
{
    $method = VirtualCardApi::first();
---
select * from `virtual_card_apis` limit 1