app/Http/Helpers/stripeCard.php

function getIssueBalance(){
    $method = VirtualCardApi::first();
---
select * from `virtual_card_apis` limit 1