database/seeders/Admin/AppSettingsSeeder.php

    public function run()
    {
        $data = [
            'version'   => '1.2.0',
            'splash_screen_image'   => 'seeder/splash_screen.png',
            'url_title'   => 'App Url',
            'android_url'   => 'https://play.google.com/store',
            'iso_url'   => 'https://www.apple.com/app-store',
            'created_at' => date('Y-m-d H:i:s'),
              'updated_at' => date('Y-m-d H:i:s'),
        ];
        AppSettings::truncate();
        AppSettings::firstOrCreate($data);
---
insert into `app_settings` (`version`, `splash_screen_image`, `url_title`, `android_url`, `iso_url`, `created_at`, `updated_at`) values ('1.0.0', 'seeder/splash_screen.png', 'App Url', 'https://play.google.com/store', 'https://www.apple.com/app-store', '2023-09-18 11:14:38', '2023-09-18 11:14:38')


          ];
          AppOnboardScreens::truncate();
          AppOnboardScreens::insert($onboard);
---
insert into `app_onboard_screens` (`created_at`, `id`, `image`, `last_edit_by`, `status`, `sub_title`, `title`, `updated_at`) values ('2023-09-18 11:14:38', 1, 'seeder/Onboard1.png', 1, 1, 'Users can easily create virtual credit cards from here. Use anytime anywhere and unlimited. Thanks for start a new journey with StripCard.', 'Create Unlimited Virtual Cards for Unlimited Usage', '2023-09-18 11:14:38'), ('2023-09-18 11:14:38', 2, 'seeder/Onboard2.png', 1, 1, 'StripCard has the most secure system which is very useful for money transactions. Get ready to use unlimited virtual credit card system.', 'Easy, Quick & Secure System for Create Virtual Card', '2023-09-18 11:14:38')