database/seeders/Admin/TransactionSettingSeeder.php

insert into `transaction_settings` (`admin_id`, `daily_limit`, `fixed_charge`, `max_limit`, `min_limit`, `monthly_limit`, `percent_charge`, `slug`, `title`) values (1, 0, 1, 1000, 10, 0, 1, 'transfer-money', 'Transfer Money Charge')
---
    public function run()
    {
        $data = [
            [
                'admin_id'          => 1,
                'slug'              => "transfer-money",
                'title'             => "Transfer Money Charge",
                'fixed_charge'       => 1,
                'percent_charge'     => 1,
                'min_limit'         => 10,
                'max_limit'         => 1000,
                'monthly_limit'     => 0,
                'daily_limit'       => 0,
            ],
            [
                'admin_id'          => 1,
                'slug'              => "virtual_card",
                'title'             => "Virtual Card Charges",
                'fixed_charge'      => 2,
                'percent_charge'    => 1,
                'min_limit'         => 100,
                'max_limit'         => 50000,
                'monthly_limit'     => 0,
                'daily_limit'       => 0,
            ],
        ];
        TransactionSetting::truncate();
        TransactionSetting::insert($data);