app/Http/Controllers/Admin/DashboardController.php

select * from `virtual_card_apis` limit 1
---
    public function __construct()
    {
        $cardApi = VirtualCardApi::first();

select * from `transactions` where `type` = 'ADD-MONEY' order by `created_at` desc limit 5
---
    public function index()
    {

        $page_title = "Dashboard";
        $transactions = Transaction::with(
            'user:id,firstname,lastname,email,username,full_mobile',
              'currency:id,name'
          )->where('type', 'ADD-MONEY')->latest()->take(5)->get();

select count(*) as aggregate from `users`
select count(*) as aggregate from `users` where `email_verified` = 0
select count(*) as aggregate from `users` where `status` = 1
select count(*) as aggregate from `users` where `status` = 0
---
            $pending_add_money_percent = (($pending_add_money_balance * 100) / $last_month_pending_add_money);
        }
        //User
        $total_user = User::toBase()->count();
        $unverified_user = User::toBase()->where('email_verified', 0)->count();
        $active_user = User::toBase()->where('status', 1)->count();
        $banned_user = User::toBase()->where('status', 0)->count();

select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2023-09-01' and `status` = 2
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2023-09-01' and `status` = 1
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2023-09-01' and `status` = 4
select count(*) as aggregate from `transactions` where `type` = 'ADD-MONEY' and date(`created_at`) = '2023-09-01' and `status` = 3
---
            $start_date = date('Y-m-d', $start);

            // Monthley add money
            $pending = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 2)
                                        ->count();
            $success = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 1)
                                        ->count();
            $canceled = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 4)
                                        ->count();
            $hold = Transaction::where('type', PaymentGatewayConst::TYPEADDMONEY)
                                        ->whereDate('created_at',$start_date)
                                        ->where('status', 3)
                                        ->count();

select count(*) as aggregate from `transactions` where `type` = 'VIRTUAL-CARD' and date(`created_at`) = '2023-09-01' and `status` = 2
select count(*) as aggregate from `transactions` where `type` = 'VIRTUAL-CARD' and date(`created_at`) = '2023-09-01' and `status` = 1
select count(*) as aggregate from `transactions` where `type` = 'VIRTUAL-CARD' and date(`created_at`) = '2023-09-01' and `status` = 4
select count(*) as aggregate from `transactions` where `type` = 'VIRTUAL-CARD' and date(`created_at`) = '2023-09-01' and `status` = 3
---
            $hold_data[]     = $hold;

            //Monthley virtual
            $card_pending = Transaction::where('type', PaymentGatewayConst::VIRTUALCARD)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 2)
                        ->count();
            $card_success = Transaction::where('type', PaymentGatewayConst::VIRTUALCARD)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 1)
                        ->count();
            $card_canceled = Transaction::where('type', PaymentGatewayConst::VIRTUALCARD)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 4)
                        ->count();
            $card_hold = Transaction::where('type', PaymentGatewayConst::VIRTUALCARD)
                        ->whereDate('created_at',$start_date)
                        ->where('status', 3)
                        ->count();

select count(*) as aggregate from `blogs` where `status` = 1 and date(`created_at`) = '2023-09-01'
---

            // Event,Campaign,Gallery

            $event = Blog::where('status', 1)
            ->whereDate('created_at',$start_date)
            ->count();