app/Http/Controllers/Admin/UserCareController.php

select count(*) as aggregate from `users`
---
    public function index()
    {
        $page_title = "All Users";
        $users = User::orderBy('id', 'desc')->paginate(12);